docs/information_theory.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-01-18 Thu 20:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Information Theory</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jethro Kuan" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Information Theory</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgde056b4">1. How to measure information</a></li>
<li><a href="#org740395b">2. How to compress information</a></li>
<li><a href="#orgc40d6ee">3. How to communicate securely over an insecure channel</a>
<ul>
<li><a href="#org0106d90">3.1. Error-correcting codes for the binary symmetric channel</a>
<ul>
<li><a href="#org0fff7ca">3.1.1. Repetition Codes</a></li>
<li><a href="#org5ecc17f">3.1.2. Block Codes - the (7, 4) Hamming Code</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgde056b4" class="outline-2">
<h2 id="orgde056b4"><span class="section-number-2">1</span> How to measure information</h2>
</div>
<div id="outline-container-org740395b" class="outline-2">
<h2 id="org740395b"><span class="section-number-2">2</span> How to compress information</h2>
</div>
<div id="outline-container-orgc40d6ee" class="outline-2">
<h2 id="orgc40d6ee"><span class="section-number-2">3</span> How to communicate securely over an insecure channel</h2>
<div class="outline-text-2" id="text-3">
<p>
There is a non-zero probability that the transmitted message is
different from the received message.
</p>

<p>
<i>Information theory</i> is concerned with the theoretical limitations and
potentials of systems, and the best error-correcting performance we
could achieve.
</p>

<p>
<i>Coding theory</i> is concerned with the creation of practical encoding
and decoding systems.
</p>
</div>
<div id="outline-container-org0106d90" class="outline-3">
<h3 id="org0106d90"><span class="section-number-3">3.1</span> Error-correcting codes for the binary symmetric channel</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org0fff7ca" class="outline-4">
<h4 id="org0fff7ca"><span class="section-number-4">3.1.1</span> Repetition Codes</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>Repeat every bit of the message a prearranged number of times. Take
the bit that has the majority vote.</li>
</ul>
</div>
</div>
<div id="outline-container-org5ecc17f" class="outline-4">
<h4 id="org5ecc17f"><span class="section-number-4">3.1.2</span> Block Codes - the (7, 4) Hamming Code</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li>Add redundancy to blocks of data instead of encoding one bit at a time</li>
<li>A block code is a rule for converting a sequence of source bits <code>s</code>,
of length <code>K</code>, into a transmitted sequence <code>t</code> of length <code>N</code> bits.
<ul class="org-ul">
<li>In a linear block code, the extra <code>N - K</code> bits are linear
functions of the original <code>K</code> bits, and are called <i>parity-check</i>
bits.</li>
</ul></li>
</ul>

<p>
Because the Hamming code is a linear code, it can be written compactly
in terms of matrices:
</p>

\begin{equation*}
  \text{transmitted} = G^T \text{source}
\end{equation*}

<p>
where \(G\) is the generator matrix of the code.
</p>

<p>
Syndrome decoding for the Hamming code involves checking the parity bits.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jethro Kuan</p>
<p class="date">Created: 2018-01-18 Thu 20:32</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
